uploads/xml/Travelport-Request-662a01c810efd-8906.xml

<?xml version="1.0"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Header/>
  <soapenv:Body>
    <air:LowFareSearchReq xmlns:air="http://www.travelport.com/schema/air_v51_0" xmlns:com="http://www.travelport.com/schema/common_v51_0" SolutionResult="false" TargetBranch="P3763969" TraceId="99cf53bca7d0d5e5074b0366f52a5950">
      <com:BillingPointOfSaleInfo OriginApplication="UAPI"/>
      <air:SearchAirLeg>
        <air:SearchOrigin>
          <com:CityOrAirport Code="DXB"/>
        </air:SearchOrigin>
        <air:SearchDestination>
          <com:CityOrAirport Code="CMB"/>
        </air:SearchDestination>
        <air:SearchDepTime PreferredTime="2024-06-28">
          <com:SearchExtraDays DaysBefore="3" DaysAfter="3"/>
        </air:SearchDepTime>
        <air:AirLegModifiers>
          <air:PermittedCabins>
            <com:CabinClass Type="Economy"/>
          </air:PermittedCabins>
        </air:AirLegModifiers>
      </air:SearchAirLeg>
      <air:SearchAirLeg>
        <air:SearchOrigin>
          <com:CityOrAirport Code="CMB"/>
        </air:SearchOrigin>
        <air:SearchDestination>
          <com:CityOrAirport Code="DXB"/>
        </air:SearchDestination>
        <air:SearchDepTime PreferredTime="2024-08-24">
          <com:SearchExtraDays DaysBefore="3" DaysAfter="3"/>
        </air:SearchDepTime>
        <air:AirLegModifiers>
          <air:PermittedCabins>
            <com:CabinClass Type="Economy"/>
          </air:PermittedCabins>
        </air:AirLegModifiers>
      </air:SearchAirLeg>
      <air:AirSearchModifiers>
        <air:PreferredProviders>
          <com:Provider Code="1G"/>
        </air:PreferredProviders>
      </air:AirSearchModifiers>
      <com:SearchPassenger Code="ADT" Age="30"/>
      <com:SearchPassenger Code="ADT" Age="30"/>
      <com:SearchPassenger Code="CNN" Age="10"/>
      <com:SearchPassenger Code="CNN" Age="10"/>
      <air:AirPricingModifiers CurrencyType="SAR"/>
    </air:LowFareSearchReq>
  </soapenv:Body>
</soapenv:Envelope>
